define(function(require, exports, module){
	 "use strict";
	var constant = {
		fileSize:2
	};
	var info = {
		info_0001 : "用户未登录",
		info_1000 : "手机号码为空",
		info_1001 : "手机号码已存在",
		info_1002 : "手机号码可用",
		info_1003 : "手机号码不正确",
		info_1004 : "手机号码未注册",
		info_1005 : "手机号修改成功",
		info_1006 : "手机号修改失败",
		info_1007 : "手机号修改异常",
		
		
		info_2000 : "验证码发送成功",
		info_2001 : "验证码发送失败",
		info_2002 : "验证码错误",
		info_2003 : "验证码发送太频繁",
		info_2004 : "验证码错误",
		info_2005 : "验证码重复，请重新发送",
		info_2006 : "验证码模块为空",
		info_2007 : "验证码可用",
		info_2008 : "验证码错误",
		info_2013 : "注册验证码发送受限",
		
		
		info_3000 : "用户为空",
		info_3001 : "手机号已注册",
		info_3002 : "用户手机号为空",
		info_3003 : "用户密码为空",
		info_3004 : "验证码为空",
		info_3005 : "用户注册成功",
		info_3006 : "用户注册失败",
		info_3007 : "用户密码重置成功",
		info_3008 : "用户密码重置失败",
		info_3009 : "用户密码重置操作异常",
		info_3010 : "被操作的手机号与当前用户的手机号不一致，请刷新后再试",
		info_3012 : "用户账号已被锁定",

		
		
		
		info_4001 : "购物车id非法",
		info_4002 : "无法批量修改购物车重量",
		info_4003 : "重量和选中至少需要修改一个",
		info_4004 : "无法同时修改重量和选中",
		info_4005 : "购物车提交失败",
		info_4006 : "购物车提交成功",
		info_4007 : "购物车添加失败",
		info_4008 : "购物车添加成功",
		info_4009 : "购物车更新失败",
		info_4010 : "购物车更新成功",
		info_4011 : "购物车删除失败",
		info_4012 : "购物车删除成功",
		
		info_4013 : "购物车获取成功",
		info_4014 : "购物车为空,提交失败",
		info_4015 : "无资源可加入购物车",
		
		
		
		info_5000 : "用户登陆类型为空",
		info_5001 : "登陆密码为空",
		info_5002 : "登陆成功",
		info_5003 : "登陆失败",
		info_5004 : "验证码错误",
		
		
		
		info_6000 : "上传文件成功",
		info_6001 : "上传文件失败",
		info_6002 : "文件格式不正确",
		info_6003 : "文件超过"+constant.fileSize+"M",
		info_6004 : "没有找到上传的文件",
		info_6005 : "非法上传文件",
		
		
		info_7000 : "需求提交成功",
		info_7001 : "需求提交失败",
		info_7002 : "采购需求过长",
		info_7003 : "需求提交太频繁",
		
		
		info_8000 : "获取待办事项成功",
		info_8001 : "获取待办事项失败",
		info_8002 : "时间格式错误",
		
		info_9000 : "询价单获取成功",
		info_9001 : "询价单详情获取成功"
	};
	function getCodeMsg(code){
		return info["info_"+code];
	};
	module.exports = {
		getCodeMsg : getCodeMsg
	}
});
